## 🧾 Terraform Plan for `iam_group`

> ⚠️ Review this carefully before applying changes

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.test_group_advanced["administrators"].aws_iam_group.this will be created
  + resource "aws_iam_group" "this" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Administrators"
      + path      = "/user_groups/administrators/"
      + unique_id = (known after apply)
    }

  # module.test_group_advanced["administrators"].aws_iam_group_membership.this will be created
  + resource "aws_iam_group_membership" "this" {
      + group = "Administrators"
      + id    = (known after apply)
      + name  = "Administrators-membership"
      + users = [
          + "Oreoluwa",
        ]
    }

  # module.test_group_advanced["administrators"].aws_iam_group_policy_attachment.this[0] will be created
  + resource "aws_iam_group_policy_attachment" "this" {
      + group      = "Administrators"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
    }

  # module.test_group_advanced["cloud"].aws_iam_group.this will be created
  + resource "aws_iam_group" "this" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Cloud"
      + path      = "/user_groups/cloud/"
      + unique_id = (known after apply)
    }

  # module.test_group_advanced["cloud"].aws_iam_group_membership.this will be created
  + resource "aws_iam_group_membership" "this" {
      + group = "Cloud"
      + id    = (known after apply)
      + name  = "Cloud-membership"
      + users = [
          + "Charlie",
          + "Dave",
        ]
    }

  # module.test_group_advanced["development"].aws_iam_group.this will be created
  + resource "aws_iam_group" "this" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Development"
      + path      = "/user_groups/development/"
      + unique_id = (known after apply)
    }

  # module.test_group_advanced["development"].aws_iam_group_membership.this will be created
  + resource "aws_iam_group_membership" "this" {
      + group = "Development"
      + id    = (known after apply)
      + name  = "Development-membership"
      + users = [
          + "Alice",
          + "Bob",
        ]
    }

  # module.test_group_basic["administrators"].aws_iam_group.this will be created
  + resource "aws_iam_group" "this" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Administrators"
      + path      = "/user_groups/administrators/"
      + unique_id = (known after apply)
    }

  # module.test_group_basic["administrators"].aws_iam_group_membership.this will be created
  + resource "aws_iam_group_membership" "this" {
      + group = "Administrators"
      + id    = (known after apply)
      + name  = "Administrators-membership"
      + users = [
          + "Oreoluwa",
        ]
    }

  # module.test_group_basic["administrators"].aws_iam_group_policy_attachment.this[0] will be created
  + resource "aws_iam_group_policy_attachment" "this" {
      + group      = "Administrators"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
    }

  # module.test_group_basic["cloud"].aws_iam_group.this will be created
  + resource "aws_iam_group" "this" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Cloud"
      + path      = "/user_groups/cloud/"
      + unique_id = (known after apply)
    }

  # module.test_group_basic["cloud"].aws_iam_group_membership.this will be created
  + resource "aws_iam_group_membership" "this" {
      + group = "Cloud"
      + id    = (known after apply)
      + name  = "Cloud-membership"
      + users = [
          + "Charlie",
          + "Dave",
        ]
    }

  # module.test_group_basic["development"].aws_iam_group.this will be created
  + resource "aws_iam_group" "this" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Development"
      + path      = "/user_groups/development/"
      + unique_id = (known after apply)
    }

  # module.test_group_basic["development"].aws_iam_group_membership.this will be created
  + resource "aws_iam_group_membership" "this" {
      + group = "Development"
      + id    = (known after apply)
      + name  = "Development-membership"
      + users = [
          + "Alice",
          + "Bob",
        ]
    }

Plan: 14 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

<!-- Sticky Pull Request Comment -->